kacpercierpiak/PSOC/EXTRA/RF_I2C_BRIDGE/RF_I2C_BRIDGE/backup/cyfisnp_protocol.c
//*****************************************************************************
//*****************************************************************************
//  FILENAME: CYFISNP_Protocol.c
//  Version: 2.00, Updated on 2011/6/28 at 6:7:54
//  Generated by PSoC Designer 5.1.2306
//
//  DESCRIPTION: <NODE> Star Network Protocol Protocol implementation
//-----------------------------------------------------------------------------
//  Copyright (c) Cypress Semiconductor 2011. All Rights Reserved.
//*****************************************************************************
//*****************************************************************************

#define CYFISNP_PROTOCOL_C

#include <m8c.h>        // part specific constants and macros
#include <FlashBlock.h>
#include "PSoCAPI.h"    // PSoC API definitions for all User Modules
#include "psocGpioInt.h"
#include "CYFISNP.h"

#define NO_RX_PACKET    CYFISNP_ABORT_SUCCESS     // Better name

#define CYFISNP_nSS_IS_PPSOC_FN (0x18 > 100)

// ---------------------------------------------------------------------------
// Calculate the battery powered node's "Response Delay" (dominated by CPU_CLK)
//  This is passed in the BindRequest so the can delay Responses as needed.
//  RULE: HUB IS NEVER SLOWER THAN THE NODE (the node is presumed battery
//        powered and establishes the response time that the hub must meet,
//        it's not negotiated).
// ---------------------------------------------------------------------------
#if   (CYFISNP_CPU_CLK == 24)
    #define SNP_RSP_DELAY   (160/10)    // 160 uS
#elif (CYFISNP_CPU_CLK == 12)
    #define SNP_RSP_DELAY   (280/10)    // 280 uS
#elif (CYFISNP_CPU_CLK == 6)
    #define SNP_RSP_DELAY   (450/10)    // 450 uS
#elif (CYFISNP_CPU_CLK == 3)
    #define SNP_RSP_DELAY   (830/10)    // 830 uS
#else
    // ERROR - CPU CLOCK TOO SLOW FOR CYFISNP
    // DRC should generate this warning
    #define SNP_RSP_DELAY (830/10)    // Dirty workaround to allow compilation with default parameters
#endif

//#define TEST_DISABLE_DYNAMIC_PA       // (testing only)


// ---------------------------------------------------------------------------
// SNP PACKET HEADERS
// ---------------------------------------------------------------------------
#define PKT_PING_TYPE       0x00
#define PKT_PING_LEN        2       // Protocol + DevID

#define PKT_BINDREQ_TYPE    0x00
#define PKT_BINDREQ_LEN     7

#define PKT_BINDRSP_TYPE    0x10
#define PKT_BINDRSP_LEN     10

#define PKT_CONREQ_TYPE    0x00
#define PKT_CONREQ_LEN     6

#define PKT_CONRSP_TYPE    0x10
#define PKT_CONRSP_LEN     6

#define PKT_UNBIND_TYPE     0x10
#define PKT_UNBIND_LEN      2

#define PKT_SEQBIT_MASK     0x03
#define PKT_SEQSYNC         0x02
#define PKT_DATA_FCD_TYPE   0x20
#define PKT_DATA_BCD_TYPE   0x30
#define PKT_BCDR_MASK       0x04


// ---------------------------------------------------------------------------
//
// PUBLIC VARIABLES
//
// ---------------------------------------------------------------------------
CYFISNP_PROT_STATE  CYFISNP_eProtState;

BYTE CYFISNP_bCurrentChannel;


// ---------------------------------------------------------------------------
// CYFISNP_txBuf - Holds Tx Packets, ONLY for Private Protocol use
// ---------------------------------------------------------------------------
#define SNP_PROT_PKT_TX_MAX 7                   // Largest Tx Protocol Packet
#define SNP_PROT_PKT_RX_MAX 10                  // Largest Rx Protocol Packet
static BYTE SNP_txBuf[SNP_PROT_PKT_TX_MAX];

// ---------------------------------------------------------------------------
// PHYSICAL_BCD_PACKET_MAX = biggest physical BCD buffer required.
// ---------------------------------------------------------------------------
#if CYFISNP_BCD_PAYLOAD_MAX >= SNP_PROT_PKT_RX_MAX
#define PHYSICAL_BCD_PACKET_MAX     (CYFISNP_BCD_PAYLOAD_MAX + 1)
#else
#define PHYSICAL_BCD_PACKET_MAX     SNP_PROT_PKT_RX_MAX
#endif

// ---------------------------------------------------------------------------
// RX_PKT - Holds Rx Packets, shared between API and Private Protocol use
// ---------------------------------------------------------------------------
typedef union {
    struct {            // Structure passed to API
        BYTE length;
        BYTE rssi;
        BYTE type;
        BYTE devId;
        BYTE payload[CYFISNP_BCD_PAYLOAD_MAX]; // Holds Rx API pkt
    } api;
    struct {            // Structure passed from Radio
        BYTE length;
        BYTE rssi;
        BYTE devId;
        BYTE pkt[SNP_PROT_PKT_RX_MAX];      // Holds Rx protocol packet
    } snp;
} SNP_RX_PKT;
static SNP_RX_PKT  SNP_rxBuf;


// ---------------------------------------------------------------------------
//
// Dynamic DataRate and Dynamic PA
//
// ---------------------------------------------------------------------------


BYTE CYFISNP_radioTxConfig;        // [4:3] = GFSK or 8DR
// GFSK_INUSE - macro to check whether GFSK is currently specified
#define GFSK_INUSE ((CYFISNP_radioTxConfig   \
                   & CYFISNP_TX_DATMODE_MSK) \
                  == CYFISNP_DATMODE_1MBPS)
// --------------------------
BYTE CYFISNP_paLevel;              // logical PA level
#define PA_LEVEL_MAX 7
#define PA_LEVEL_MIN 0


// -----------------------------------------------------------------------
// GFSK (dpwrQualGfsk) and 8DR (dpwrQual8dr) channel quality metrics.
//   these are driven by each transmission AutoAck success or failure.
// -----------------------------------------------------------------------
#define QUAL_KSHIFT       3
#define QUAL_KVAL       (1<<QUAL_KSHIFT)
#define QUAL_ROUNDOFF   (QUAL_KVAL-1)           // round-off so 0 is possible
#define QUAL_MAX       ((QUAL_KVAL * QUAL_KVAL) - QUAL_ROUNDOFF)
#define QUAL_AVE        (QUAL_MAX /2)
#define QUAL_THRESHOLD  (QUAL_MAX * 0.70)
static BYTE         dpwrQualGfsk;
static BYTE         dpwrQual8dr;

// -----------------------------------------------------------------------
// QUAL_CONSEC_MAX - Number of consecutive transmissions at MAX metric before
//                   Tx power is reduced by 1 step.
// -----------------------------------------------------------------------
#define QUAL_CONSEC_MAX 8
static BYTE         dpwrMaxConsecGfsk;
static BYTE         dpwrMaxConsec8dr;
static char         dpwrStayCt;



// ---------------------------------------------------------------------------
//
// PRIVATE VARIABLES
//
// ---------------------------------------------------------------------------
static BOOL         fTsb;       // Transmit Sequence Bit
static BOOL         fEsb;       // Expected Sequence Bit

static BOOL         rxBufPend;

static RADIO_STATE  radioStateCopy;
static BYTE         rxLen;


// ---------------------------------------------------------------------------
// CYFISNP_IdleReceive
//      XACT_STATE_SYNTH - CYFISNP_XACT_CFG_ADR settings when in SYNTH
//      XACT_STATE_IDLE1 - CYFISNP_XACT_CFG_ADR settings when in IDLE
//      XACT_STATE_IDLE2 - CYFISNP_XACT_CFG_ADR settings when in IDLE
//
//
//  wall-powered            battery-powered
//   IDLE = SYNTH           tx->idle1->idle2
// ---------------------------------------------------------------------------

static BOOL idleReceive;            // TRUE = Idle Radio in Rx, not Sleep
#define XACT_COMMON         (CYFISNP_ACK_EN | CYFISNP_ACK_TO_8X)
#define XACT_STATE_SYNTH    (XACT_COMMON    | CYFISNP_END_STATE_RXSYNTH)
#define XACT_STATE_IDLE     (XACT_COMMON    | CYFISNP_END_STATE_IDLE)
#define XACT_STATE_SLEEP    (XACT_COMMON    | CYFISNP_END_STATE_SLEEP)



// ---------------------------------------------------------------------------
// CYFISNP_DATA_PACKET_RETRIES - Max Tx data attempts before Timeout
// ---------------------------------------------------------------------------
#define CYFISNP_DATA_PACKET_RETRIES 10
static BYTE         bDataRetryCt;
static CYFISNP_API_PKT *pTxStruct;
static BOOL         txPending;



// ---------------------------------------------------------------------------
// Response Window - How long to wait for a Response to a Request
// ---------------------------------------------------------------------------
#if CYFISNP_PWR_TYPE == CYFISNP_PWR_COIN
#define RSP_WINDOW_TIMER   (3000/200)               //  3 mS
#else                                               //
#define RSP_WINDOW_TIMER   (50/CYFISNP_TIMER_UNITS)     // 50 mS
#endif
static WORD     rspWindowTimer;                     // Response Window Timer


// ---------------------------------------------------------------------------
// onChanTxLeft - How many Connect Requests to send before changing channels.
// ---------------------------------------------------------------------------
#define ON_NEW_CHAN_TX_MAX  1       // Retry count if no AutoAck
#define ON_ACK_CHAN_TX_MAX  (10-1)  // Retry count if AutoAck
static BYTE     onChanTxLeft;
static BOOL     fGotChanAck;

#define CON_MODE_COUNT_MAX  200     // Max # Con Req to send before timeout
#define PING_MODE_COUNT_MAX 200     // Max # PingReq to send before timeout
static WORD     wModeCounter;

static WORD wModeDelay;
#define CON_MODE_FAST_TIME  (1/CYFISNP_TIMER_UNITS)
#define CON_MODE_SLOW_TIME  (200/CYFISNP_TIMER_UNITS)
#define PING_MODE_FAST_TIME (1/CYFISNP_TIMER_UNITS)
#define PING_MODE_SLOW_TIME (200/CYFISNP_TIMER_UNITS)



// ---------------------------------------------------------------------------
//
// Binding variables
//
// ---------------------------------------------------------------------------

static char bindChIdx;

// ---------------------------------------------------------------------------
// RX_WINDOW - Max time to wait for a Hub Bind Respone.
// ---------------------------------------------------------------------------
#define CYFISNP_RX_WINDOW   (3000 / 100)    // 3 mS (via 100 uS delay loop)

// ---------------------------------------------------------------------------
// BIND_MODE_COUNT_MAX - Number of Bind Requests sent before TIMEOUT
// ---------------------------------------------------------------------------
#define BIND_MODE_COUNT_MAX  500        // Give Hub time to write its Flash
static WORD wBindModeCounter;
    // ------------------------------------------------------------------------
    // bindReqTimer - Throttle BindReq to something reasonable (20 mS)
    //   If send as fast as possible, application may be sending every 2 mS and
    //   we'll burn-through BIND_MODE_COUNT_MAX so fast the person may not
    //   have time to move and push bind button on hub.
    // ------------------------------------------------------------------------
static WORD bindReqTimer;
#define BIND_REQ_TIME   (1 + 10/CYFISNP_TIMER_UNITS) // 10mS or 1 tick



// ---------------------------------------------------------------------------
//
// Wall Powered Node: Beacon Timeout Timer
//
// ---------------------------------------------------------------------------
#define BEACON_MAX_TIME     (3000 / CYFISNP_TIMER_UNITS)
static WORD beaconMaxTimer;

static BOOL CYFISNP_inRxGo;


// ---------------------------------------------------------------------------
//
// LOCAL FUNCTIONS
//
// ---------------------------------------------------------------------------
static void runConnectMode      (void);
static void gotoDataMode        (void);
static void runDataMode         (void);
static void runDataModeTx       (void);
static void runDataModeRx       (void);
static void runDataModeRxCrc0   (void);
static void gotoPingMode        (void);
static void runPingMode         (void);
static void gotoUnboundMode     (void);
static void gotoDefaultMode     (void);
// -----------------------------------
static void nextNetCh           (void);
static void putNetParams        (BYTE * pConRspPkt);
static void copyMidToTxPkt      (void);
static BOOL rxMidEquNodeMid     (BYTE *pRxMid);
// -----------------------------------
static void setMaxPaLevel       (void);
static void setPaLevel          (BYTE paLevel);
static void writeHwPa           (void);
static void decPaLevel          (void);
static void dynPaApply          (void);
static void dynPaUpdate         (BOOL ackResult);
static void toggleDataRate      (void);
static void externalPaDisable   (void);
static void externalPaEnable    (void);
static void issueRxGo           (void);
// -----------------------------------
static void gotoConnectModeBase (void);
static void gotoConnectMode     (void);
static void setBindPaLevel      (void);
static void bindRun             (void);
static BOOL netParamsPresent    (void);
static void crc0AutoAck         (BOOL enable);

static void setIdleReceive      (BOOL enable);



