kacpercierpiak/PSOC/EXTRA/RF_I2C_BRIDGE/RF_I2C_BRIDGE/backup/cyfisnp_protocol.c
// -----------------------------------
static void flashWrite          (BYTE *pSrc);
// ---------------------------------------------------------------------------


static void setNodeSeed(void) {
    CYFISNP_SetCrcSeed ((CYFISNP_EEP_NET_REC_ADR->nodeSeedMsb << 8)
                               | (CYFISNP_EEP_NET_REC_ADR->nodeSeedLsb     ));
}
static void setHubSeed(void) {
    CYFISNP_SetCrcSeed ((CYFISNP_EEP_NET_REC_ADR->hubSeedMsb << 8)
                               | (CYFISNP_EEP_NET_REC_ADR->hubSeedLsb     ));
}



// ---------------------------------------------------------------------------
//
// CYFISNP_Start() - Powerup initialization (Radio powers-up in IDLE)
//
// ---------------------------------------------------------------------------
BYTE CYFISNP_Start(void)
{
    if (CYFISNP_eProtState != 0
     && CYFISNP_eProtState != CYFISNP_STOP_MODE) {
        return 0;         // START only works at powerup and from STOP
    }

#if(CYFISNP_PSOC_EXPRESS_PROJECT == 0)
    CYFISNP_SleepTimer_Set64Hz();
    M8C_EnableIntMask(INT_MSK0, INT_MSK0_SLEEP);
#endif

    if(!CYFISNP_PhyStart())
    {
        CYFISNP_OutStr("\n\rRadio Init Failed!\n\r");
        return 0;
    }

#if !CYFISNP_DEBUG  // Stop 750KHz default on XOUT (reduce noise)
    CYFISNP_Write(CYFISNP_XTAL_CTRL_ADR, CYFISNP_XOUT_FNC_GPIO);
#endif

	CYFISNP_SetPreambleCount(CYFISNP_DEF_PREAMBLE_CNT);
    CYFISNP_ForceState(CYFISNP_END_STATE_SLEEP);  // Min radio current
    CYFISNP_SetPtr(&SNP_txBuf[0]);
    CYFISNP_SetLength(SNP_PROT_PKT_TX_MAX);
    crc0AutoAck(FALSE);

    gotoDefaultMode();
    CYFISNP_spiSleep();

    bDataRetryCt = 0;           // No more retries
    txPending = FALSE;          // Empty API's Tx buffer

    return 1;
}


// ---------------------------------------------------------------------------
//
// CYFISNP_Stop() - Can be used to "abort" a pending transmission.
//
// ---------------------------------------------------------------------------
void CYFISNP_Stop(void)
{
    CYFISNP_PhyStop();

#if(CYFISNP_PSOC_EXPRESS_PROJECT == 0)
    M8C_DisableIntMask(INT_MSK0, INT_MSK0_SLEEP);
#endif

    CYFISNP_eProtState = CYFISNP_STOP_MODE;

}



// ---------------------------------------------------------------------------
//
// CYFISNP_Jog() - Wakeup from a Time-Out power-conservation state.
//
// ---------------------------------------------------------------------------
void CYFISNP_Jog(void)
{
    CYFISNP_spiWake();
    switch (CYFISNP_eProtState) {
        case CYFISNP_CON_MODE_TIMEOUT:
             gotoConnectMode();
             break;
        case CYFISNP_PING_MODE_TIMEOUT:
            gotoPingMode();
            break;
    }
}



// ---------------------------------------------------------------------------
//
// CYFISNP_Run() = Punctuated periodic polling
//
// ---------------------------------------------------------------------------
void CYFISNP_Run(void)
{
    switch (CYFISNP_eProtState) {
        // -------------------------------------------------------------------
    case CYFISNP_BIND_MODE:
            CYFISNP_spiWake();
            bindRun();
            break;
        // -------------------------------------------------------------------
        case CYFISNP_CON_MODE:
            CYFISNP_spiWake();
            runConnectMode();
            break;
        // -------------------------------------------------------------------
        case CYFISNP_DATA_MODE:
            CYFISNP_spiWake();
            runDataMode();
            CYFISNP_spiSleep();
            break;
        // -------------------------------------------------------------------
        case CYFISNP_PING_MODE:
            CYFISNP_spiWake();
            runPingMode();
            break;
        // -------------------------------------------------------------------
        default:
            break;
    }
}


// ---------------------------------------------------------------------------
//
// gotoDefaultMode() - Goto Connect mode if are bound, otherwise go Unbound
//
// ---------------------------------------------------------------------------
static void gotoDefaultMode(void) {
    if (netParamsPresent()) {
        gotoConnectModeBase();
    }
    else {
        gotoUnboundMode();
    }
}


// ---------------------------------------------------------------------------
//
// gotoUnboundMode() - Do nothing until _BindStart() is called
//
// ---------------------------------------------------------------------------
static void gotoUnboundMode(void)
{
    CYFISNP_eProtState = CYFISNP_UNBOUND_MODE;
    CYFISNP_OutStr("<Unbound: STOP>");
}

// ---------------------------------------------------------------------------
//
//  CYFISNP_BindStart() - From Data Mode to Bind Mode
//
// ---------------------------------------------------------------------------
void CYFISNP_BindStart(BYTE DevID)
{
    CYFISNP_OutStr("\n\rStart Bind Mode");

    CYFISNP_spiWake();
    bindChIdx = 0;
    CYFISNP_bCurrentChannel = CYFISNP_BIND_CH_SEQ[bindChIdx];
    CYFISNP_SetChannel  (CYFISNP_bCurrentChannel);
    CYFISNP_SetSopPnCode(CYFISNP_BIND_MODE_SOP);

    SNP_txBuf[0] = PKT_BINDREQ_TYPE | CYFISNP_PWR_TYPE;
    SNP_txBuf[1] = DevID;
    copyMidToTxPkt();
    SNP_txBuf[6] = SNP_RSP_DELAY;

    CYFISNP_eProtState = CYFISNP_BIND_MODE;
    wBindModeCounter = BIND_MODE_COUNT_MAX;

    CYFISNP_TimeSet(&bindReqTimer, BIND_REQ_TIME);
}


// ---------------------------------------------------------------------------
//
//  bindRun() -
//
// ---------------------------------------------------------------------------
static void bindRun(void)
{
    RADIO_STATE radioStateCopy;

    if (CYFISNP_TimeExpired(&bindReqTimer) != TRUE) {
        return;
    }
    CYFISNP_TimeSet(&bindReqTimer, BIND_REQ_TIME);

    // -----------------------------------------------------------------------
    // Send another Bind Request
    // -----------------------------------------------------------------------
    if (++bindChIdx >= sizeof(CYFISNP_BIND_CH_SEQ)) {
        bindChIdx = 0;
    }
    CYFISNP_bCurrentChannel = CYFISNP_BIND_CH_SEQ[bindChIdx];
    CYFISNP_SetChannel(CYFISNP_bCurrentChannel);
    setBindPaLevel();
    crc0AutoAck(TRUE);
    CYFISNP_SetCrcSeed(CYFISNP_BIND_MODE_CRC_SEED);
    CYFISNP_SetXactConfig(0
                      | CYFISNP_ACK_EN          // Expect AutoAck
                      | CYFISNP_ACK_TO_8X
                      | CYFISNP_END_STATE_RX);  // Expect Response
    CYFISNP_SetPtr(&SNP_txBuf[0]);
    CYFISNP_StartTransmit(0, PKT_BINDREQ_LEN);
    while ((CYFISNP_State & CYFISNP_COMPLETE) == 0) {
        CYFISNP_GetTransmitState();
    }
    radioStateCopy = CYFISNP_State;
    CYFISNP_EndTransmit();

    crc0AutoAck(FALSE);
    CYFISNP_SetCrcSeed( (WORD)(SNP_txBuf[2]<<8) | SNP_txBuf[3]);

    // -----------------------------------------------------------------------
    // If AutoAck failed, power-down radio
    // -----------------------------------------------------------------------
    if ((radioStateCopy & CYFISNP_ERROR) != 0) {
        CYFISNP_ForceState(CYFISNP_END_STATE_SLEEP);
    }
    // -----------------------------------------------------------------------
    // Else AutoAck PASSED, open 3 mS BindRsp Rx window
    // -----------------------------------------------------------------------
    else {
        WORD waitDelay;
        waitDelay = CYFISNP_RX_WINDOW;

        setMaxPaLevel();                    // node sends AutoAck at full power
        CYFISNP_SetPtr(&SNP_rxBuf.snp.pkt[0]);
        CYFISNP_SetLength(SNP_PROT_PKT_RX_MAX);
        CYFISNP_SetXactConfig(0
                                | CYFISNP_ACK_EN   // Expect AutoAck
                                | CYFISNP_ACK_TO_8X
                                | CYFISNP_END_STATE_IDLE);
        CYFISNP_StartReceive();

        // -------------------------------------------------------------------
        // Maintain 3 mS BindRsp Rx window
        // -------------------------------------------------------------------
        for (;;) {
            BYTE rxLen = 0;
            radioStateCopy = CYFISNP_GetReceiveState();

            CYFISNP_Delay100uS();           // Delay 100 uS
            if (--waitDelay == 0) {
                rxLen = CYFISNP_Abort();
                if (rxLen == CYFISNP_ABORT_SUCCESS) {
                    CYFISNP_ForceState(CYFISNP_END_STATE_SLEEP);
                    break;
                }
            }
            if (radioStateCopy & CYFISNP_COMPLETE) {
                rxLen = CYFISNP_EndReceive();
                CYFISNP_ForceState(CYFISNP_END_STATE_SLEEP);

                if (radioStateCopy & CYFISNP_ERROR) {
                    break;
                }
                // -----------------------------------------------------------
                // If BindRsp received
                // -----------------------------------------------------------
                if (SNP_rxBuf.snp.pkt[0] == PKT_BINDRSP_TYPE
                 &&                rxLen == PKT_BINDRSP_LEN) {
                    putNetParams(&SNP_rxBuf.snp.pkt[0]);    // Wr to FLASH
                    gotoConnectModeBase();
                    return;         // BIND SUCCESSFUL ----- EXIT HERE
                }
            }   // end Rx Complete
        }  // end for(;;)
    }   // end AutoAck received

    if (--wBindModeCounter == 0) {
        gotoDefaultMode();          // Exhausted Bind attempts
    }
}


// ---------------------------------------------------------------------------
//
// CYFISNP_GetNodeID -
//
// ---------------------------------------------------------------------------
BYTE CYFISNP_GetNodeID(void)  {
    return(CYFISNP_EEP_NET_REC_ADR->devId);
}


// ---------------------------------------------------------------------------
//
// gotoConnectMode() - Enter connect from Powerup or Bind Response
//
// ---------------------------------------------------------------------------
static void gotoConnectModeBase(void) {
    CYFISNP_bCurrentChannel = (CYFISNP_EEP_NET_REC_ADR->chBase);
    setIdleReceive(CYFISNP_PWR_TYPE == CYFISNP_PWR_WALL);
    gotoConnectMode();
}

static void gotoConnectMode(void)
{
    CYFISNP_OutStr("\n\rStart Connect Mode. ");

    setMaxPaLevel();

    CYFISNP_SetChannel(CYFISNP_bCurrentChannel);
    CYFISNP_SetSopPnCode(CYFISNP_EEP_NET_REC_ADR->sopIdx);

    CYFISNP_eProtState = CYFISNP_CON_MODE;
    onChanTxLeft = ON_NEW_CHAN_TX_MAX;
    wModeCounter = CON_MODE_COUNT_MAX;
    CYFISNP_TimeSet(&wModeDelay, CON_MODE_FAST_TIME);

    // -----------------------------------------------------------------------
    // Since Connect Request packet doesn't change, create it ONCE
    // -----------------------------------------------------------------------
    SNP_txBuf[0] = PKT_CONREQ_TYPE;
    SNP_txBuf[1] = CYFISNP_EEP_NET_REC_ADR->devId;
    copyMidToTxPkt();
}


// ---------------------------------------------------------------------------
//
//  runConnectMode() -
//
//  The Hub may need to write Node parameters to Flash before returning the
//  ConRsp, so it may a while (4 seconds if using Ice Cube).  If the Node is
//  being a "good neighbor", it shouldn't spew ConReq ASAP if the Hub is
//  busy writing its Flash, thus:
//      1) If Node gets an ACK, it waits a while because it found the HUB
//      2) If Node gets NAK, it retransmits quickly to slew across channels
//
// ---------------------------------------------------------------------------
static void runConnectMode(void)
{
    if (CYFISNP_TimeExpired(&wModeDelay) == FALSE) {
        return;
    }
    if (wModeCounter > CON_MODE_COUNT_MAX/2 ) {
        CYFISNP_TimeSet(&wModeDelay, CON_MODE_FAST_TIME);
    } else {
        CYFISNP_TimeSet(&wModeDelay, CON_MODE_SLOW_TIME);
    }

    if (wModeCounter-- == 0) {
        CYFISNP_eProtState = CYFISNP_CON_MODE_TIMEOUT;
        CYFISNP_OutStr("\n\rConnect Mode Timeout. ");
        CYFISNP_spiSleep();
    }

    // -------------------------------------------------------------------
    // Send (another) Connect Request
    // -------------------------------------------------------------------
    if (onChanTxLeft-- <= 0) {
        onChanTxLeft = ON_NEW_CHAN_TX_MAX;
        fGotChanAck = 0;
        nextNetCh();
        CYFISNP_SetChannel(CYFISNP_bCurrentChannel);
    }

