kacpercierpiak/PSOC/EXTRA/RF_I2C_BRIDGE/RF_I2C_BRIDGE/backup/cyfisnp_protocol.c
    setHubSeed();
    CYFISNP_ForceState(CYFISNP_END_STATE_RXSYNTH);  // Expect Rx Response
    CYFISNP_SetPtr(&SNP_txBuf[0]);
    CYFISNP_StartTransmit(0, PKT_CONREQ_LEN);
    while ((CYFISNP_State & CYFISNP_COMPLETE) == 0) {
        CYFISNP_GetTransmitState();
    }
    radioStateCopy = CYFISNP_State;
    CYFISNP_EndTransmit();


    // -------------------------------------------------------------------
    // If AutoAck failed, power-down radio
    // -------------------------------------------------------------------
    if ((radioStateCopy & CYFISNP_ERROR) != 0) {
        CYFISNP_ForceState(CYFISNP_END_STATE_SLEEP);
        dynPaUpdate(0);
    }
    // -------------------------------------------------------------------
    // Else if AutoAck PASSED, then open ConRsp receive window
    //  and spend a little more time on this channel
    // -------------------------------------------------------------------
    else {
        dynPaUpdate(1<<QUAL_KSHIFT);

        fTsb = 0;                       // Zero Transmit Seq Bit

        if (fGotChanAck == 0) {
            fGotChanAck = 1;
            onChanTxLeft = ON_ACK_CHAN_TX_MAX;
        }

        #if CYFISNP_PWR_TYPE == CYFISNP_PWR_COIN
        rspWindowTimer = RSP_WINDOW_TIMER;
        #else
        CYFISNP_TimeSet(&rspWindowTimer, RSP_WINDOW_TIMER);
        #endif

        CYFISNP_SetXactConfig(XACT_STATE_IDLE); // Ok because in SYNTH
        issueRxGo();

        for (;;) {
            BYTE rxLen = 0;
            radioStateCopy = CYFISNP_GetReceiveState();

            // If Receive Window Expired, then ABORT Receive and EXIT
            #if CYFISNP_PWR_TYPE == CYFISNP_PWR_COIN
            CYFISNP_Delay100uS();                 // Delay 100 uS
            if (--rspWindowTimer == 0) {
            #else
            if (CYFISNP_TimeExpired(&rspWindowTimer)) {
            #endif
                rxLen = CYFISNP_Abort();
                if (rxLen == NO_RX_PACKET) {
                    CYFISNP_ForceState(CYFISNP_END_STATE_SLEEP);
                    break;
                }   // Else got Rx packet instead, fallthru and process it.
            }
            if (radioStateCopy & CYFISNP_ERROR) {
                CYFISNP_EndReceive();
                CYFISNP_ForceState(CYFISNP_END_STATE_SLEEP);
                break;
            }
            if (radioStateCopy & CYFISNP_COMPLETE) {
                rxLen = CYFISNP_EndReceive();
                CYFISNP_ForceState(CYFISNP_END_STATE_SLEEP);
                // -----------------------------------------------------------
                // If ConRsp received, then process and goto DATA_MODE
                // -----------------------------------------------------------
                if (                 SNP_rxBuf.snp.pkt[0] == PKT_CONRSP_TYPE
                &&                                  rxLen == PKT_CONRSP_LEN
                && rxMidEquNodeMid(&SNP_rxBuf.snp.pkt[2]) == TRUE
                ) {
                    if (SNP_rxBuf.snp.pkt[1] != 0) { // ConRsp has devId != 0
                        gotoDataMode();
                        return;         // Connect SUCCESSFUL ----- EXIT HERE
                    }
                    else {              // ConRsp has devId == 0
                        CYFISNP_Unbind();  // UNBIND ################
                        gotoUnboundMode();
                    }
                }
            } // if (radioStateCopy ....
        }
    }       // Exit "got autoack"
}
// ###########################################################################



// ---------------------------------------------------------------------------
//
// CYFISNP_TxDataPend()
//
// ---------------------------------------------------------------------------
BOOL CYFISNP_TxDataPend(void)
{
    if (txPending == 0) {
        return(FALSE);
    }
    return(TRUE);
}

// ---------------------------------------------------------------------------
//
// CYFISNP_TxDataPut()
//
// ---------------------------------------------------------------------------
BOOL CYFISNP_TxDataPut(CYFISNP_API_PKT *pStruct)
{
    BYTE lvType = PKT_DATA_FCD_TYPE;

    switch (pStruct->type) {
        case CYFISNP_API_TYPE_CONF_BCDR:
            lvType |= PKT_BCDR_MASK;
            // fallthru
        case CYFISNP_API_TYPE_CONF:
            lvType |= fTsb;               // Add Tx Seq Bit in Hdr
            bDataRetryCt = CYFISNP_DATA_PACKET_RETRIES;
            break;
        // -------------------------------------------------------------------
        case CYFISNP_API_TYPE_SYNC_BCDR:
            lvType |= PKT_BCDR_MASK;  // Add BCDR bit
            // fallthru
        case CYFISNP_API_TYPE_SYNC:
            lvType |= PKT_SEQSYNC;          // Add Sync (no deliv conf needed)
            bDataRetryCt = CYFISNP_DATA_PACKET_RETRIES;
            break;
        // -------------------------------------------------------------------
        default:        // Ignore everything else
            return FALSE;
    }

    pStruct->type  = lvType;
    pStruct->devId = CYFISNP_EEP_NET_REC_ADR->devId;
    pTxStruct      = pStruct;           // Point to API structure
    txPending = TRUE;
    return TRUE;
}



// ---------------------------------------------------------------------------
//
//  gotoDataMode() - From Connect or Ping Mode to Data Mode
//
//   runDataMode() - Send a Tx Data packet
//
// ---------------------------------------------------------------------------
static void gotoDataMode(void)
{
    CYFISNP_OutStr("\n\rStart Data Mode. ");
    setMaxPaLevel();
    CYFISNP_eProtState = CYFISNP_DATA_MODE;
    if (CYFISNP_TxDataPend() == TRUE) {        // If Tx Data pending
        bDataRetryCt = CYFISNP_DATA_PACKET_RETRIES; // Then retry some more
        CYFISNP_Jog();
    }
    if (idleReceive) {
        CYFISNP_ForceState(CYFISNP_END_STATE_IDLE);     // Manually wake
        issueRxGo();                                    // Enter Receive
        CYFISNP_inRxGo = TRUE;
        CYFISNP_TimeSet(&beaconMaxTimer, BEACON_MAX_TIME);
    }
}


// ---------------------------------------------------------------------------
// issueRxGo() -
// ---------------------------------------------------------------------------
static void issueRxGo(void) {
    CYFISNP_SetPtr      (&SNP_rxBuf.snp.pkt[0]);
    CYFISNP_SetLength   (PHYSICAL_BCD_PACKET_MAX);
    setNodeSeed();
    CYFISNP_StartReceive();
}

// ---------------------------------------------------------------------------
// setIdleReceive() - Application may idle in Receive or Sleep
//
// Used in a hybrid node, where SLEEPs most of the time, but infrequently
//  wants to do Application delineated periods of low-latency back channel
//  data (for example Vista SideShow traffic).
// ---------------------------------------------------------------------------
static void setIdleReceive(BOOL enable) {

    if (idleReceive != enable) {
        idleReceive = enable;
        if (enable == FALSE) {
            rxLen = CYFISNP_Abort();                        // Stop Receive
            CYFISNP_ForceState(CYFISNP_END_STATE_SLEEP);    // Low power
            CYFISNP_inRxGo = FALSE;
        }
        if (enable == TRUE) {
            CYFISNP_ForceState(CYFISNP_END_STATE_IDLE);     // Manually wake
            issueRxGo();                                    // Enter Receive
            CYFISNP_inRxGo = TRUE;
            CYFISNP_TimeSet(&beaconMaxTimer, BEACON_MAX_TIME);
       }
    }
}



// ---------------------------------------------------------------------------
//
// runDataMode() - Handle Data Mode polled processes.
//
//  If radio idles in Receive, this includes servicing and rearming the
//   radio receiver.  Idling in Receive also means an Rx Abort process before
//   transmitting a packer.
//
//  If radio idles in Sleep, only monitor and service a pending Tx packet.
//
// ---------------------------------------------------------------------------
static void runDataMode(void)
{
    rxLen = NO_RX_PACKET;

    // -----------------------------------------------------------------------
    // If Tx Data is pending, service it
    // -----------------------------------------------------------------------
    if (bDataRetryCt != 0) {
        if (CYFISNP_inRxGo == TRUE) {       // If RX_GO invoked,
            rxLen = CYFISNP_Abort();    //  Then Abort (might get Rx pkt)
            CYFISNP_inRxGo = FALSE;
        }
        if (rxLen == NO_RX_PACKET) {    // Normal case, Rx aborted w/o RxPkt
            runDataModeTx();            // Service pending Tx Data
            return;
        } else {                        // Rx Aborted WITH Rx Packet received
            runDataModeRx();            // Service Rx packet
            return;                     // Exit w/o RX_GO
        }
    }

    // -----------------------------------------------------------------------
    // If IDLE in RECEIVE Mode, then
    // -----------------------------------------------------------------------
    if (idleReceive) {

        // -------------------------------------------------------------------
        // Watch for missing Hub Beacon
        // -------------------------------------------------------------------
        if (CYFISNP_TimeExpired(&beaconMaxTimer)) {
            rxLen = CYFISNP_Abort();
            CYFISNP_inRxGo = FALSE;
            if (rxLen == NO_RX_PACKET) {
                gotoPingMode();         // Beacon Timeout
            } else {
                CYFISNP_TimeSet(&beaconMaxTimer, BEACON_MAX_TIME);
                runDataModeRx();        // Service Rx Packet
            }
            return;
        }

        // -------------------------------------------------------------------
        // Ensure in RX_GO
        // -------------------------------------------------------------------
        if (CYFISNP_inRxGo == FALSE) {      // If not in Receive
            CYFISNP_ForceState(CYFISNP_END_STATE_RXSYNTH);
            issueRxGo();                //  Then get in Receive
            CYFISNP_inRxGo = TRUE;
        }

        // -------------------------------------------------------------------
        // Monitor and service received packet
        // -------------------------------------------------------------------
        radioStateCopy = CYFISNP_GetReceiveState();
        if (radioStateCopy & CYFISNP_COMPLETE) {
            rxLen = CYFISNP_EndReceive();
            if (radioStateCopy & CYFISNP_ERROR) {
                // -----------------------------------------------------------
                // Rx CRC0 Packets report as ERROR because DIS_CRC0 is SET
                //  during node Receive to suppress AutoAck, BUT CRC0 packets
                //  have RX_CRC0 status SET indicating they're OK
                // -----------------------------------------------------------
                char statReg;
                statReg  = CYFISNP_Read(CYFISNP_RX_STATUS_ADR);
                statReg &= CYFISNP_RX_PKTERR|CYFISNP_RX_EOPERR|CYFISNP_RX_CRC0;
                if (statReg == CYFISNP_RX_CRC0) {
                    runDataModeRxCrc0();    // Rx packet used CRC0 (no error)
                } else {
                    // silently discard Rx packet w/Error
                }
            }
            else {
                runDataModeRx();        // Service receiver
            }
            issueRxGo();                // Rearm Receiver
        }
    }
}


// ---------------------------------------------------------------------------
//
// runDataModeRx() - Received good packet (non-CRC0 Seed), process it
//
//          rxLen = length of received packet
// ---------------------------------------------------------------------------
static void runDataModeRx(void)
{
    BYTE lvRxType;
    lvRxType = SNP_rxBuf.snp.pkt[0];

    if (rxLen == PKT_UNBIND_LEN && lvRxType == PKT_UNBIND_TYPE) {
        CYFISNP_Unbind();
    }
    else if (rxLen != 0
     && (lvRxType & 0xFC) == PKT_DATA_BCD_TYPE) {

        SNP_rxBuf.api.length = rxLen - 1;     // Get Payload Length
        SNP_rxBuf.api.rssi   = CYFISNP_GetRssi()
                             & CYFISNP_RSSI_LVL_MSK;

        SNP_rxBuf.api.type = (lvRxType == (PKT_DATA_BCD_TYPE+2)) ?
                                CYFISNP_API_TYPE_SYNC :
                                CYFISNP_API_TYPE_CONF;

