kacpercierpiak/PSOC/EXTRA/RF_I2C_BRIDGE/RF_I2C_BRIDGE/backup/cyfisnp_protocol.c
        SNP_rxBuf.api.devId  = CYFISNP_EEP_NET_REC_ADR->devId;
        rxBufPend = TRUE;                   // Pass packet to API
    }
}

// ---------------------------------------------------------------------------
//
// runDataModeRxCrc0() - Received good CRC0 packet, process it
//
//          rxLen = length of received packet
// ---------------------------------------------------------------------------
static void runDataModeRxCrc0(void) {
    CYFISNP_TimeSet(&beaconMaxTimer, BEACON_MAX_TIME);
}




// ---------------------------------------------------------------------------
//
// runDataModeTx() - Tx 1 Burst in a dedicated function
//
// ---------------------------------------------------------------------------
static void runDataModeTx(void)
{
    if (--bDataRetryCt == 0) {
        gotoPingMode();     // FAILED TO DELIVER PACKET, CHANGE TO PING MODE
    }

    // -------------------------------------------------------------------
    // Transmit Data Packet
    // -------------------------------------------------------------------
    setHubSeed();
    dynPaApply();            // Dynamic Power

    if ((pTxStruct->type & PKT_BCDR_MASK) == 0 && idleReceive == FALSE) {
        CYFISNP_ForceState(CYFISNP_END_STATE_IDLE); // Set Radio IDLE
    }
    else {
        CYFISNP_ForceState(CYFISNP_END_STATE_TXSYNTH); // Set Radio in SYNTH
    }

    CYFISNP_SetPtr          (&pTxStruct->type);
    CYFISNP_StartTransmit   (0, pTxStruct->length + 2);
    while ((CYFISNP_State & CYFISNP_COMPLETE) == 0) {
        CYFISNP_GetTransmitState();
    }
    radioStateCopy = CYFISNP_State;
    CYFISNP_EndTransmit();

    // -------------------------------------------------------------------
    // If AutoAck failed, Idle radio and EXIT
    // -------------------------------------------------------------------
    if ((radioStateCopy & CYFISNP_ERROR) != 0) {
        dynPaUpdate(0);
        if (idleReceive == FALSE) {
            CYFISNP_ForceState(XACT_STATE_SLEEP);   // Manually put to SLEEP
        }
        return;
    }
    dynPaUpdate(1<<QUAL_KSHIFT);

    // -------------------------------------------------------------------
    // Delivered packet
    // -------------------------------------------------------------------
    bDataRetryCt = 0;           // No more retries
    txPending = FALSE;          // Empty API's Tx buffer

    // -------------------------------------------------------------------
    // Inc Transmit Seq Bit if Tx Pkt used the Tx Seq Bit
    // -------------------------------------------------------------------
    if ((pTxStruct->type & PKT_SEQBIT_MASK) < PKT_SEQSYNC) {
        fTsb ^= 1;              // Inc mod-2
    }

    // -------------------------------------------------------------------
    // If Back Channel Data Request flag was zero, exit
    // -------------------------------------------------------------------
    if ((pTxStruct->type & PKT_BCDR_MASK) == 0) {
        if (idleReceive == FALSE)  {
            CYFISNP_ForceState(CYFISNP_END_STATE_SLEEP);
        }
    }
    // -----------------------------------------------------------------------
    // Else Open Back Channel Receive Window
    // -----------------------------------------------------------------------
    else {
        #if CYFISNP_PWR_TYPE == CYFISNP_PWR_COIN
        rspWindowTimer = (3000/200);     // 3,000 uS / 200 uS
        #else
        CYFISNP_TimeSet(&rspWindowTimer, RSP_WINDOW_TIMER);
        #endif

        issueRxGo();

        // -------------------------------------------------------------------
        // Wait for Back Channel packet or Window Timeout
        // -------------------------------------------------------------------
        for (;;) {

            radioStateCopy = CYFISNP_GetReceiveState();

            // ---------------------------------------------------------------
            // Monitor Rx Window Timeout
            // ---------------------------------------------------------------
            #if CYFISNP_PWR_TYPE == CYFISNP_PWR_COIN        // Use short accurate delay
            CYFISNP_Delay100uS();                       // Delay 100 uS
            if (--rspWindowTimer == 0)              // to minimize power
            #else                                   // ELSE Alkaline battery
            if (CYFISNP_TimeExpired(&rspWindowTimer))   // use timer
            #endif
                {
                rxLen = CYFISNP_Abort();
                if (rxLen == NO_RX_PACKET) {
                    if (idleReceive == FALSE)  {
                        CYFISNP_ForceState(CYFISNP_END_STATE_SLEEP);
                    }
                    break;
                }
            }
            // ---------------------------------------------------------------
            // Monitor for Rx Packet Error
            // ---------------------------------------------------------------
            if (radioStateCopy & CYFISNP_ERROR) {
                CYFISNP_EndReceive();
                if (idleReceive == FALSE)  {
                    CYFISNP_ForceState(CYFISNP_END_STATE_SLEEP);
                }
                break;
            }
            // ---------------------------------------------------------------
            // Monitor for Rx Packet Success
            // ---------------------------------------------------------------
            if (radioStateCopy & CYFISNP_COMPLETE) {
                rxLen = CYFISNP_EndReceive();
                if (idleReceive == FALSE)  {
                    CYFISNP_ForceState(CYFISNP_END_STATE_SLEEP);
                }
                runDataModeRx();            // Process Rx Packet
                break;
            }
        }
        setHubSeed();
    } // Exit "Else Open Back Channel Receive Window"
}



// ---------------------------------------------------------------------------
// CYFISNP_RxDataPend()
// ---------------------------------------------------------------------------
BOOL CYFISNP_RxDataPend(void)
{
    return (rxBufPend);
}

// ---------------------------------------------------------------------------
// CYFISNP_RxDataGet()
// ---------------------------------------------------------------------------
    CYFISNP_API_PKT *               // Return pointer to Rx API structure
CYFISNP_RxDataGet(void)
{
    return((CYFISNP_API_PKT *) &SNP_rxBuf.api);
}

// ---------------------------------------------------------------------------
// CYFISNP_RxDataRelease()
// ---------------------------------------------------------------------------
void CYFISNP_RxDataRelease(void)
{
    rxBufPend = FALSE;
}


// ---------------------------------------------------------------------------
//
// gotoPingMode()
//
// runPingMode() -
//
// ---------------------------------------------------------------------------
static void gotoPingMode(void)
{
    CYFISNP_OutStr("\n\rStart Ping Mode. ");
    setMaxPaLevel();
    CYFISNP_eProtState = CYFISNP_PING_MODE;
    wModeCounter   = PING_MODE_COUNT_MAX;
    CYFISNP_TimeSet(&wModeDelay, PING_MODE_FAST_TIME);

