kacpercierpiak/PSOC/EXTRA/RF_I2C_BRIDGE/RF_I2C_BRIDGE/backup/cyfisnp_protocol.c
    // ------------------
    // Create PING packet
    // ------------------
    SNP_txBuf[0] = PKT_PING_TYPE;
    SNP_txBuf[1] = CYFISNP_EEP_NET_REC_ADR->devId;
}

static void runPingMode(void)
{

    if (CYFISNP_TimeExpired(&wModeDelay) == FALSE) {
        return;
    }
    if (wModeCounter > PING_MODE_COUNT_MAX/2 ) {
        CYFISNP_TimeSet(&wModeDelay, PING_MODE_FAST_TIME);
    } else {
        CYFISNP_TimeSet(&wModeDelay, PING_MODE_SLOW_TIME);
    }

    if (wModeCounter-- == 0) {
        // -------------------------------------------------------------------
        // Since can't find Hub, it's possible that it's been replaced and the
        //  Node should send a packet with BCDR to revalidate the Node's ID,
        //  so timeout in Connect Mode to revalidate at eventual Jog()
        // -------------------------------------------------------------------
        CYFISNP_eProtState = CYFISNP_CON_MODE_TIMEOUT;
        CYFISNP_OutStr("\n\rPing Timeout, goto Connect Timeout. ");
        CYFISNP_spiSleep();
        return;
    }

    // -------------------------------------------------------------------
    // Send another Ping Request on next channel
    // -------------------------------------------------------------------
    nextNetCh();
    CYFISNP_SetChannel   (CYFISNP_bCurrentChannel);
    setHubSeed();
    CYFISNP_SetXactConfig(XACT_STATE_IDLE);     // Expect NO BCD
    CYFISNP_SetPtr       (&SNP_txBuf[0]);
    CYFISNP_StartTransmit(0, PKT_PING_LEN);
    while ((CYFISNP_State & CYFISNP_COMPLETE) == 0) {
        CYFISNP_GetTransmitState();
    }
    radioStateCopy = CYFISNP_State;
    CYFISNP_EndTransmit();

    // -------------------------------------------------------------------
    // If AutoAck PASSED, then resume Data Mode
    // -------------------------------------------------------------------
    if ((radioStateCopy & CYFISNP_ERROR) == 0) {
        setHubSeed();
        gotoDataMode();
    }
}


// ---------------------------------------------------------------------------
// nextNetCh() - Advance to next Data Channel (everything but Bind Mode)
// ---------------------------------------------------------------------------
static void nextNetCh(void)
{
    BYTE hop;
    hop = CYFISNP_EEP_NET_REC_ADR->chHop + 1;
    hop = (hop * 2) + (hop * 4);        // hop * 6 (help "lite" compiler)

    CYFISNP_bCurrentChannel += hop;

    if (CYFISNP_bCurrentChannel  > CYFISNP_CHAN_MAX) {
        CYFISNP_bCurrentChannel -= CYFISNP_MAX_CHANNELS;
    }
    while ((signed char)CYFISNP_bCurrentChannel < CYFISNP_CHAN_MIN) {
        CYFISNP_bCurrentChannel += hop;
    }
}


// ---------------------------------------------------------------------------
// rxMidEquNodeMid() - Compare the Rx MID with this Node's MID (from the radio)
// ---------------------------------------------------------------------------
static BOOL rxMidEquNodeMid(BYTE *pRxMid)
{
    BYTE *pNodeMid;
    char ivar;
    BYTE nodeMid[6];        // CYFISNP_GetFuses( void ) needs 6 Byte MID buffer

    CYFISNP_SetPtr(&nodeMid[0]);
    CYFISNP_SetLength(CYFISNP_SIZEOF_MID);
    CYFISNP_GetFuses();

    pNodeMid = &nodeMid[0];
    for (ivar = CYFISNP_SIZEOF_MID; *pNodeMid == *pRxMid && ivar != 0; --ivar) {
        ++pNodeMid;
        ++pRxMid;
    }
    return(ivar == 0);
}

// ---------------------------------------------------------------------------
// copyMidToTxPkt() - Copy Node MID to Bind or Connect Req Tx pkt area
// ---------------------------------------------------------------------------
static void copyMidToTxPkt(void)
{
    CYFISNP_SetPtr   (&SNP_txBuf[2]);
    CYFISNP_SetLength(CYFISNP_SIZEOF_MID);
    CYFISNP_GetFuses ();
}

// ---------------------------------------------------------------------------
//
// putNetParams() - Extract Network Params from BindRsp and put in FLASH
//
// ---------------------------------------------------------------------------
static void putNetParams(BYTE * pRxPkt)
{
    CYFISNP_EEP_NET_REC net;

    // -------------------------------------------------------------------
    // Compose RAM image to write to FLASH
    // -------------------------------------------------------------------
    net.devId       = pRxPkt[1];
    net.hubSeedMsb  = pRxPkt[6];
    net.hubSeedLsb  = pRxPkt[7];
    net.sopIdx      = pRxPkt[9] >> 3;
    net.chHop       = pRxPkt[9] & 7;            // Flash is {0-7}
    net.chBase      = pRxPkt[8];
    net.nodeSeedMsb = pRxPkt[6];
    net.nodeSeedLsb = pRxPkt[7] ^ pRxPkt[1];    // LSB Hub Seed ^ devId

    CYFISNP_OutStr("--Got netParams ");
    flashWrite((char *)&net);
}


// ---------------------------------------------------------------------------
//
// CYFISNP_Unbind()
//
// ---------------------------------------------------------------------------
void CYFISNP_Unbind(void)
{
    CYFISNP_EEP_NET_REC net;

    net.devId       = 0;            // ------------------------------------
    net.hubSeedMsb  = 0;            // Compose RAM image to write to FLASH
    net.hubSeedLsb  = 0;            // ------------------------------------
    net.sopIdx      = 0;
    net.chHop       = 0;
    net.chBase      = 0;
    net.nodeSeedMsb = 0;
    net.nodeSeedLsb = 0;

    CYFISNP_OutStr("--Unbinding...");
    flashWrite((char *)&net);
    CYFISNP_OutStr("Done. ");
    gotoUnboundMode();
}


// ---------------------------------------------------------------------------
//
// flashWrite() - Write RAM image to FLASH by possibly device-specific method
//
// ---------------------------------------------------------------------------

// Dummy function (for now)
BYTE CYFISNP_GetDieTemp(void)
{
// @PSoC_UserCode_DieTemp@ (Do not change this line.)
    return 20;
// @PSoC_UserCode_END@ (Do not change this line.)
}


#if HI_TECH_C
#pragma warning push
#pragma warning disable 350
#endif
static void flashWrite (BYTE *pSrc)
{
    // -----------------------------------------------------------------------
    // If this RAM image already exists in FLASH, then no need to write it
    // -----------------------------------------------------------------------
    {
        char ivar;
        const BYTE *pFlash;
        BYTE       *pRam;
        pRam   = pSrc;
        pFlash = (const BYTE *)CYFISNP_EEP_PHY_ADR;
        ivar = sizeof(CYFISNP_EEP_NET_REC);
        for (; ivar != 0 && *pRam++ == *pFlash++; --ivar);
        if (ivar == 0) {
            return;
        }
    }

    // -----------------------------------------------------------------------
    // Write the RAM image to FLASH
    // -----------------------------------------------------------------------
    CYFISNP_OutStr("--Writing to Flash...");
    {
//      struct {
//          BYTE   bARG_BlockId;           // block ID
//          BYTE  *pARG_FlashBuffer;       // flash buffer pointer - 2 bytes
//          CHAR   cARG_Temperature;       // die Temperature, -40 to 100
//          BYTE   bDATA_PWErase;          // Temporary storage (reserved)
//          BYTE   bDATA_PWProgram;        // Temporary storage (reserved)
//          BYTE   bDATA_PWMultiplier;     // Temporary storage (reserved)
//      } fwStruct;
        FLASH_WRITE_STRUCT fwStruct;

