kacpercierpiak/PSOC/EXTRA/RF_I2C_BRIDGE/RF_I2C_BRIDGE/backup/cyfisnp_protocol.c
    #define CYFISNP_EEP_BLK_NUM ( CYFISNP_EEP_PHY_ADR / 0x40 )  // 64-Bytes/Flash Page

    #if (CYFISNP_FLASH_BLOCK_NUMBER_IS_WORD)
        fwStruct.wARG_BlockId     = CYFISNP_EEP_BLK_NUM;
    #else
        fwStruct.bARG_BlockId     = CYFISNP_EEP_BLK_NUM;
    #endif

        fwStruct.pARG_FlashBuffer = pSrc;
        fwStruct.cARG_Temperature = CYFISNP_GetDieTemp();
        if (bFlashWriteBlock((FLASH_WRITE_STRUCT*)&fwStruct) == 0) {
            while (1);      // Flash write failed, halt here
        }
    }
    CYFISNP_OutStr("Done. ");
}
#if HI_TECH_C
#pragma warning pop
#endif




// ---------------------------------------------------------------------------
//
// dynPaUpdate() - Based on AutoAck result, update GSK or 8DR statistic.
//
// ---------------------------------------------------------------------------
static void dynPaUpdate(BOOL ackResult)
{
    if (GFSK_INUSE) {
        dpwrQualGfsk = dpwrQualGfsk + ackResult
                   - ((dpwrQualGfsk + QUAL_ROUNDOFF) >> QUAL_KSHIFT);
    }
    else {
        dpwrQual8dr = dpwrQual8dr  + ackResult
                  - ((dpwrQual8dr + QUAL_ROUNDOFF) >> QUAL_KSHIFT);
    }
}



// ---------------------------------------------------------------------------
//
// dynPaApply() - Select desired power level and modulation for Tx packet
//
// ---------------------------------------------------------------------------
#define incSaturate(val)   (val = (val<QUAL_CONSEC_MAX) ? val+1 : val)
static void dynPaApply(void)
{
    // -----------------------------------------------------------------------
    // Track how long each statistic has been at QUAL_MAX
    // -----------------------------------------------------------------------
    if (dpwrQualGfsk == QUAL_MAX) {
        incSaturate(dpwrMaxConsecGfsk);     // ++counter to QUAL_CONSEC_MAX
    } else {
        dpwrMaxConsecGfsk = 0;
    }
    if (dpwrQual8dr  == QUAL_MAX) {
        incSaturate(dpwrMaxConsec8dr);      // ++counter to QUAL_CONSEC_MAX
    } else {
        dpwrMaxConsec8dr = 0;
    }

    // -----------------------------------------------------------------------
    // If both statistics are QUAL_MAX for QUAL_CONSEC_MAX, then reduce PA
    // -----------------------------------------------------------------------
    if ((dpwrQualGfsk == QUAL_MAX && dpwrMaxConsecGfsk == QUAL_CONSEC_MAX)
     && (dpwrQual8dr  == QUAL_MAX && dpwrMaxConsec8dr  == QUAL_CONSEC_MAX)) {
        decPaLevel();
        dpwrMaxConsecGfsk = dpwrMaxConsec8dr = 0;
    }

    // -----------------------------------------------------------------------
    // Else if both statistics "stink", then PA = MAX
    // -----------------------------------------------------------------------
    else if (dpwrQualGfsk < QUAL_THRESHOLD && dpwrQual8dr < QUAL_THRESHOLD) {
        setMaxPaLevel();
    }

    // -----------------------------------------------------------------------
    // Pick the Data Rate with the best statistic, favor GFSK
    // -----------------------------------------------------------------------
    if (--dpwrStayCt == 0) {
        toggleDataRate();                       // CHANGE MODULATION
        if (dpwrQualGfsk >= QUAL_THRESHOLD) {       // GFSK=HI, 8DR=dont-care
            dpwrStayCt = GFSK_INUSE ? 4 : 1;        // 4 GFSK : 1 8DR
        }
        else if  (dpwrQual8dr >= QUAL_THRESHOLD) {  // GFSK=LO, 8DR=HI
            dpwrStayCt = GFSK_INUSE ? 1 : 4;        // 1 GFSK : 4 8DR
        }
        else {                                      // GFSK=LO, 8DR=LO
            dpwrStayCt = GFSK_INUSE ? 1 : 1;        // 1 GFSK : 1 8DR
        }
    }

//  // DEBUG stuff only compiles if CYFISNP_DEBUG is defined
//  CYFISNP_OutStr(" <dynPA:");
//  CYFISNP_OutHex(CYFISNP_GetQualGfsk());              // GFSK quality
//  CYFISNP_OutHex(CYFISNP_GetQual8dr());               // 8DR quality
//  CYFISNP_OutChar((CYFISNP_radioTxConfig & 8) ? '.' : 'G'); // (.)8DR or (G)GFSK
//  CYFISNP_OutNibble(CYFISNP_paLevel);                 // PA Level
//  CYFISNP_OutNibble(CYFISNP_Read(CYFISNP_TX_CFG_ADR) & 7);  // Radio PA Level
//  CYFISNP_OutStr(">");
}

// ---------------------------------------------------------------------------
//
// toggleDataRate() - Toggle between GFSK and 8DR
//
// ---------------------------------------------------------------------------
static void toggleDataRate(void)
{
    if (GFSK_INUSE) {
        CYFISNP_radioTxConfig &= ~CYFISNP_TX_DATMODE_MSK;
        CYFISNP_radioTxConfig |=  CYFISNP_DATMODE_8DR;
        CYFISNP_Write(CYFISNP_ANALOG_CTRL_ADR, 0);  // Disable all slow
    }
    else {  // 8DR Used
        CYFISNP_radioTxConfig &= ~CYFISNP_TX_DATMODE_MSK;
        CYFISNP_radioTxConfig |=  CYFISNP_DATMODE_1MBPS;
        CYFISNP_Write(CYFISNP_ANALOG_CTRL_ADR, CYFISNP_ALLSLOW);
    }
    writeHwPa();
}


// ---------------------------------------------------------------------------
// setMaxPaLevel() - Set Maximum Tx power
// ---------------------------------------------------------------------------
static void setMaxPaLevel(void)
{
    setPaLevel(PA_LEVEL_MAX);
}

// ---------------------------------------------------------------------------
// setBindPaLevel() - Possibly set lower Tx power for Bind Request
// ---------------------------------------------------------------------------
static void setBindPaLevel(void)
{
    setPaLevel(CYFISNP_PA_LEVEL_BIND);
}


// ---------------------------------------------------------------------------
// setPaLevel() - Set Tx power and assume everything's OK
// ---------------------------------------------------------------------------
static void setPaLevel(BYTE paLevel)
{
    CYFISNP_paLevel = paLevel;
    writeHwPa();

    dpwrQualGfsk = QUAL_MAX;    // Quality metric at MAX (assume we're OK)
    dpwrQual8dr  = QUAL_MAX;    // Quality metric at MAX (assume we're OK)

    dpwrMaxConsecGfsk = 0;      // Zero consecutive counters
    dpwrMaxConsec8dr  = 0;      // Zero consecutive counters
    dpwrStayCt = 1;             // Will start toggling
}

// ---------------------------------------------------------------------------
// decPaLevel() - Metrics are good, try decreasing Tx power
// ---------------------------------------------------------------------------
static void decPaLevel(void)
{
    if (CYFISNP_paLevel == PA_LEVEL_MIN) {
        return;
    }
#ifndef TEST_DISABLE_DYNAMIC_PA
    --CYFISNP_paLevel;
#endif
    writeHwPa();
}


// ---------------------------------------------------------------------------
// writeHwPa() - Write PA Level to hardware
// ---------------------------------------------------------------------------
static void writeHwPa(void)
{
    BYTE regVal = CYFISNP_PA_PHY_TBL[CYFISNP_paLevel]
                & CYFISNP_PA_VAL_MSK;

