kacpercierpiak/PSOC/EXTRA/RF_I2C_BRIDGE/RF_I2C_BRIDGE/backup/cyfisnp_protocol.c
#if (CYFISNP_EXTERNAL_PA)
    BOOL paOn = ((CYFISNP_PA_PHY_TBL[CYFISNP_paLevel] & 0xF0) != 0);
    if (paOn )      externalPaEnable();
    else            externalPaDisable();
#endif

    CYFISNP_SetTxConfig(CYFISNP_radioTxConfig + regVal);
}


// If external PA hardware is installed (either Disabled or Enabled)
#if (CYFISNP_EXTERNAL_PA)
// ---------------------------------------------------------------------------
//
// externalPaEnable()  - Enable  external PA
// externalPaDisable() - Disable external PA
//
// ---------------------------------------------------------------------------
static void externalPaEnable(void)
{
    char regVal;
    // -----------------------------------------------------------------------
    // PACTL_pin = PACTL Function
    // -----------------------------------------------------------------------
    regVal  =  CYFISNP_Read(CYFISNP_IO_CFG_ADR);
    regVal &= ~CYFISNP_PACTL_GPIO;
    CYFISNP_Write(CYFISNP_IO_CFG_ADR, regVal);

    // -----------------------------------------------------------------------
    //  XOUT_pin = ~PACTL Function (inverse of PACTL)
    // -----------------------------------------------------------------------
    regVal  =  CYFISNP_Read(CYFISNP_XTAL_CTRL_ADR);
    regVal &= ~CYFISNP_XOUT_FNC_MSK;
    regVal |=  CYFISNP_XOUT_FNC_PA_N;
    CYFISNP_Write(CYFISNP_XTAL_CTRL_ADR, regVal);
}

static void externalPaDisable(void)
{
    char regVal;

//  // -----------------------------------------------------------------------
//  // Values for PACTL and XOUT when configured for Vendor_A GPIO
//  // PACTL = GPIO = 0 (no power for External PA)
//  //  XOUT = GPIO = 1 (connect Radio directly to antenna)
//  // -----------------------------------------------------------------------
//  regVal  =  CYFISNP_Read(CYFISNP_GPIO_CTRL_ADR);
//  regVal |=  CYFISNP_XOUT_OP;                 //  XOUT = 1
//  regVal &= ~CYFISNP_PACTL_OP;                // PACTL = 0
//  CYFISNP_Write(CYFISNP_GPIO_CTRL_ADR, regVal);

    // -----------------------------------------------------------------------
    //  PACTL_pin = GPIO Function  (= LOW)
    // -----------------------------------------------------------------------
    regVal  = CYFISNP_Read(CYFISNP_IO_CFG_ADR);
    regVal |= CYFISNP_PACTL_GPIO;
    CYFISNP_Write(CYFISNP_IO_CFG_ADR, regVal);

    // -----------------------------------------------------------------------
    //  XOUT_pin = GPIO Function (= HIGH)
    // -----------------------------------------------------------------------
    regVal  =  CYFISNP_Read(CYFISNP_XTAL_CTRL_ADR);
    regVal &= ~CYFISNP_XOUT_FNC_MSK;
    regVal |=  CYFISNP_XOUT_FNC_GPIO;
    CYFISNP_Write(CYFISNP_XTAL_CTRL_ADR, regVal);
}
#endif //  #if (CYFISNP_EXTERNAL_PA)


#if (CYFISNP_PWR_TYPE != CYFISNP_PWR_WALL)
// ---------------------------------------------------------------------------
//
// CYFISNP_spiSleep() - Minimize LRADIO power
//
//  This disconnects SPI, so you can't communicate with the Radio until
//   subsequently calling CYFISNP_spiWake().
//
// ---------------------------------------------------------------------------
static BYTE old_XtalCtrlAdr;
static BYTE old_IoCfgAdr;
static BYTE old_GpioCtrlAdr;
static BYTE old_XactCfgAdr;
static BOOL spiSleeping;

void CYFISNP_spiSleep(void)
{
    if (spiSleeping == TRUE) {
        return;
    }
    spiSleeping = TRUE;

    // -----------------------------------------------------------------------
    // Save CYFISPI settings so they can be restored via CYFISNP_spiWake()
    // -----------------------------------------------------------------------
    old_XtalCtrlAdr = CYFISNP_Read(CYFISNP_XTAL_CTRL_ADR);
    old_IoCfgAdr    = CYFISNP_Read(CYFISNP_IO_CFG_ADR);
    old_XactCfgAdr  = CYFISNP_GetXactConfig();
    old_GpioCtrlAdr = CYFISNP_Read(CYFISNP_GPIO_CTRL_ADR);
#if (CYFISNP_EXTERNAL_PA)
    old_GpioCtrlAdr |=  CYFISNP_XOUT_OP;       //  XOUT = 1
    old_GpioCtrlAdr &= ~CYFISNP_PACTL_OP;      // PACTL = 0
#endif

    // -----------------------------------------------------------------------
    // If RADIO is not sleeping, then manually FORCE to sleep
    //  (if it's already asleep, then don't wakeup just to put it to sleep).
    // -----------------------------------------------------------------------
    if ((old_XactCfgAdr&CYFISNP_END_STATE_MSK) != CYFISNP_END_STATE_SLEEP) {
        CYFISNP_ForceState(0);
    }

    // -----------------------------------------------------------------------
    // Since Radio could be operating on lower voltage than CPU, drive
    //  {MOSI,SCK,nSS} CPU outputs LOW to stop leakage from CPU to RADIO power
    //
    // Set XOUT LOW by setting to GPIO to minimize SPI/Radio current.
    // Set MISO LOW by changing to GPIO to keep from floating.
    // Set MOSI LOW by ensuring MISO is LOW during final SPI operation
    // -----------------------------------------------------------------------
    CYFISNP_Write(CYFISNP_XTAL_CTRL_ADR,
                  CYFISNP_XOUT_FNC_GPIO);           // XOUT=GPIO
    CYFISNP_Write(CYFISNP_IO_CFG_ADR, 0x42);        // SPI3PIN & MISO GPIO
                    // MISO goes LOW because that's MISO_GPIO's default
    CYFISNP_Write(CYFISNP_GPIO_CTRL_ADR ,0x00);     // XOUT=0 and leave MISO=0
                    // MOSI ends LOW because MISO[7] was 0 during last Write
    CYFISNP_RADIO_SELECT;
    // SPI NOT FUNCTIONAL UNTIL CYFISNP_spiWake() IS CALLED
}

// ---------------------------------------------------------------------------
//
// CYFISNP_spiWake() - Restore normal Radio operation,
//                              Called to exit CYFISNP_spiSleep().
//
// ---------------------------------------------------------------------------
void CYFISNP_spiWake(void)
{
    if (spiSleeping == FALSE) {
        return;
    }
    spiSleeping = FALSE;
	CYFISNP_RADIO_DESELECT;
    CYFISNP_Write(CYFISNP_IO_CFG_ADR,    old_IoCfgAdr);     // Restore SPI3PIN
    CYFISNP_Write(CYFISNP_GPIO_CTRL_ADR, old_GpioCtrlAdr);  // Restore GPIO
    CYFISNP_Write(CYFISNP_XTAL_CTRL_ADR, old_XtalCtrlAdr);  // Restore XOUT FN

    if ((old_XactCfgAdr&CYFISNP_END_STATE_MSK) != CYFISNP_END_STATE_SLEEP) {
        CYFISNP_ForceState(old_XactCfgAdr);          // Restore radio state
    }
}
#endif // (CYFISNP_PWR_TYPE != CYFISNP_PWR_WALL)


// ---------------------------------------------------------------------------
//
// netParamsPresent() - Determine currently Bound
//                          A valid hubSeedMsb is never 0x00
//
// ---------------------------------------------------------------------------
static BOOL netParamsPresent (void) {
    if (CYFISNP_EEP_NET_REC_ADR->hubSeedMsb != 0) {
        return(TRUE);
    }
    return(FALSE);
}

// ---------------------------------------------------------------------------
// crc0AutoAck() - Disable and enable autoacks for CRC0 packets.
//
//  When transmitting w/CRC0, we expect an AutoAck (e.g. Bind/ParamReq).
//  When receiving w/CRC0, we don't want to return an AutoAck (e.g. Beacon)
// ---------------------------------------------------------------------------
static void crc0AutoAck(BOOL enable) {
    if (enable == TRUE) {
        CYFISNP_Write(CYFISNP_RX_OVERRIDE_ADR, 0);
    } else {
        CYFISNP_Write(CYFISNP_RX_OVERRIDE_ADR, CYFISNP_DIS_CRC0);
    }
}


BYTE CYFISNP_GetQualGfsk(void) {        // Debug access for API
    return (dpwrQualGfsk);
}
BYTE CYFISNP_GetQual8dr(void) {         // Debug access for API
    return(dpwrQual8dr);
}
// ###########################################################################
